mutt.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-15 Thu 01:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mutt</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Mutt</h1>
<p>
Mutt is a text-based but powerful mail user agent (MUA) in the world of Unix/Linux. Originally, it is nothing but a MUA. However, it can make use of other programs to edit, send and receive mails. For example, it uses vim to edit mails, msmtp to send mails and getmail to receive mails. This is just the philosophy of Unix.
</p>

<p>
In ArchLinux operation system (OS), the mutt package is compiled with interactive mail access protocol (IMAP), post office protocol (POP) 3 and simple message transfer protocol (SMTP) support. In this case, mutt not only can manage mails, but also can send and receive mails. At least for me, it’s the best choice.
</p>

<p>
Above all, the package can be installed by
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S mutt
</pre>
</div>
<p>
Then create a configuration file <code>muttrc</code> in <code>~/.mutt</code> with the content below:
</p>
<div class="org-src-container">
<pre class="src src-sh">## imap settings
set folder="imaps://imap.gmail.com/"
set spoolfile="+INBOX"
set postponed="+[Gmail]/Drafts"
set record="+[Gmail]/Sent Mail"
mailboxes "+INBOX"
set imap_user="ID@gmail.com"
set imap_pass="PASSWORD"
set imap_keepalive=300
set mail_check=120

## smtp settings
set smtp_url="smtp://$imap_user:$imap_pass@smtp.gmail.com"
set ssl_force_tls="yes"

## other settings
set realname="Shaka"
set signature="~/.mutt/signature"
set alias_file="~/.mutt/alias"
source $alias_file
set header_cache="~/.mutt/header_cache"
set pager_stop="yes"
set editor="emacs -nw"
set indent_str="&gt;"
auto_view text/html
</pre>
</div>

<p>
where, <code>ID</code> and <code>PASSWORD</code> are respectively ID and password for my Gmail account. <code>~/.mutt/signature</code> is my signature file, which will be appended at the end of each mail before sent. <code>~/.mutt/alias</code> is my contact list. The entry
</p>
<div class="org-src-container">
<pre class="src src-sh">set pager_stop="yes"
</pre>
</div>
<p>
is used to stop pager to read next mail when it arrives at the end of current one. In addition, <i>emacs</i> is the my favorite editor and I edit mails with it. 
</p>
</div>
</body>
</html>
